# ir_codes.py
# 專門放「紅外線資料」

# 電源鍵
NEC_TV_POWER = [                        # 定義一組 NEC 協議的紅外線脈衝資料                    
    8860, 4465,                               # Header：9ms mark + 4.5ms space
    619, 1664, 609, 555, 581, 557, 579, 1665,
    608, 556, 581, 557, 579, 559, 578, 560,
    576, 561, 576, 1679, 593, 1667, 606, 559,
    584, 1660, 606, 1665, 608, 1662, 620, 1651,
    602, 1669, 603, 562, 575, 1668, 604, 561,
    576, 561, 575, 563, 573, 1671, 602, 562,
    574, 564, 573, 1671, 601, 563, 574, 1670,
    602, 1669, 604, 1667, 606, 559, 577, 1667,
    605
]

NEC_TV_VOL_UP = [
    # 另一組 pulses
]

NEC_TV_VOL_DOWN = [
    # ...
]

# 用 dict 管理所有遙控碼
CODES = {
    "NEC_TV_POWER": NEC_TV_POWER,
    "NEC_TV_VOL_UP": NEC_TV_VOL_UP,
    "NEC_TV_VOL_DOWN": NEC_TV_VOL_DOWN
}

